#include "screaming_eagle.h"
#include "se_device.h"
#include "se_functions.h"

#include "common/common_firmware.h"
#include "common/common_reset.h"
#include "swift/swift_serdes.h"

#include "stringify.h"
#include "utility.h"
#include "sdk.h"

#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

static CredoError_t se_fw_mark_off_lanes(CredoSlice_t* slice, unsigned mask) {
    for (int lane_num = 0; lane_num < slice->desc->lane_count; lane_num++) {
        if (mask & (1 << lane_num)) {
            ERR_PROPS(hal_set_lane_mode(slice, lane_num, CR_LMODE_OFF));
        }
    }
    return CR_OK;
}

static CredoError_t se_fw_get_event_time(CredoSlice_t* slice, int lane, unsigned index, unsigned* sec) {
    unsigned msb = 0, lsb = 0;
    ERR_PROPS(hal_fw_debug_cmd_ex(slice, lane, SE_INFO, index, &msb, &lsb));
    *sec = ((msb << 16) | lsb) * FW_TIME_UNIT;
    return CR_OK;
}

CredoError_t se_fw_get_raw_cmd_address(CredoSlice_t* slice, unsigned* addr) {
    *addr = REG_CMD_RAW;
    return CR_OK;
}

CredoError_t se_fw_get_feature(CredoSlice_t* slice, unsigned* feature) {
    unsigned response = 0, response_param = FW_CMD_LOG_SILENT;
    unsigned feature_en = 0;
    CredoError_t err = hal_fw_cmd(slice, FW_CMD_FEATURE_EN, 0, &response, &response_param);
    feature_en = ((response << 16) + response_param) & 0xffffff;
    if (err != CR_OK || feature_en != FW_FEATURE_ENABLE) {
        *feature = 0;
        return CR_OK;
    }


        LOGS_ERROR("addr 0x%08x must be aligned 4", addr);
        return CR_INVALID_ARGS;
    }

    while (count != 0) {
        unsigned val;

        sec_count = (count > MAX_SECTION_COUNT) ? MAX_SECTION_COUNT : count;
        ERR_PROPS(se_fw_spiflash_cmd(slice, FW_CMD_SPI_READ, addr & 0xFFFF, (addr >> 16) & 0xFFFF, NULL, NULL, NULL));

        for (int i = 0; i < sec_count; i++) {
            ERR_PROPS(readTop(slice, REG_DATA + i * 2 + 0, &val));
            buf[buf_idx++] = (val >> 8) & 0xFF;
            buf[buf_idx++] = (val >> 0) & 0xFF;
            ERR_PROPS(readTop(slice, REG_DATA + i * 2 + 1, &val));
            buf[buf_idx++] = (val >> 8) & 0xFF;
            buf[buf_idx++] = (val >> 0) & 0xFF;
        }

        count -= sec_count;
        addr += sec_count * 4;
    }

    return CR_OK;
}

CredoError_t se_fw_spiflash_write(CredoSlice_t* slice, unsigned addr, const unsigned* buffer, unsigned count) {
    unsigned sec_count;
    unsigned buf_idx = 0;
    unsigned char* buf = (unsigned char*)buffer;

    // LOGS_WARN("addr 0x%08X, count %d", addr, count);
    if (addr & 0x3) {
        LOGS_ERROR("addr 0x%08x must be aligned 4", addr);
        return CR_INVALID_ARGS;
    }
    while (count != 0) {
        sec_count = (count > MAX_SECTION_COUNT) ? MAX_SECTION_COUNT : count;

        for (int i = 0; i < sec_count; i++) {
            ERR_PROPS(writeTop(slice, REG_DATA + i * 2 + 0, (buf[buf_idx + 0] << 8) | (buf[buf_idx + 1] << 0)));
            ERR_PROPS(writeTop(slice, REG_DATA + i * 2 + 1, (buf[buf_idx + 2] << 8) | (buf[buf_idx + 3] << 0)));
            buf_idx += 4;
        }

        ERR_PROPS(se_fw_spiflash_cmd(slice, FW_CMD_SPI_WRITE + sec_count - 1, (addr & 0xFFFF), (addr >> 16) & 0xFFFF,
                                     NULL, NULL, NULL));

        count -= sec_count;
        addr += sec_count * 4;
    }

    return CR_OK;
}

static CredoError_t se_fw_spiflash_write_after_erase(CredoSlice_t* slice, unsigned addr, const unsigned* buffer,
                                                     unsigned count) {
    for (int i = 0; i < count; i++) {
        if ((addr + i * 4) % 4096 == 0) ERR_PROPS(se_fw_spiflash_erase(slice, addr + i * 4));
    }

    ERR_PROPS(se_fw_spiflash_write(slice, addr, buffer, count));
    return CR_OK;
}

/*              SPI Flash Layout
 *  0x000000  +-------------------+
 *            | Boot record table |
 *            |   8 KiB           |
 *  0x002000  +-------------------+
 *            | Slot 0 Firmware   |
 *            |   256 KiB         |
 *  0x042000  +-------------------+
 *            | Slot 1 Firmware   |
 *            |   256 KiB         |
 *  0x082000  +-------------------+
 *            | Slot 2 Firmware   |
 *            |   256 KiB         |
 *  0x0C2000  +-------------------+
 *            | Slot 3 Firmware   |
 *            |   256 KiB         |
 *  0x102000  +-------------------+
 *            | Slot 4 Firmware   |
 *            |   256 KiB         |
 *  0x142000  +-------------------+
 */

#define MAX_SLOT_CNT 5
typedef struct {
    uint32_t checksum[8]; /* 32B, SHA256 sum */
    uint8_t revision[4];  /*  4B, firmware revision */
    uint32_t img_src;     /*  4B, firmware image flash load address (flash addressing) */
    uint32_t img_size;    /*  4B, firmware image size in bytes */
    uint32_t rsvd;        /*  4B, reserved */
} SlotInfo_t;             /* total = 48B */

typedef struct {
    uint32_t tag;                  /*  4B, 'CRDO' */
    uint32_t history;              /*  4B - largest history number will be loaded */
    SlotInfo_t slot[MAX_SLOT_CNT]; /* 240B, 48*5 = 240 */
    uint32_t active_slot;          /*  4B, active slot number */
    uint32_t checksum;             /*  4B, checksum of the FwInfo so that the
                                       sum in uint32 is 0 */
} FWInfo_t;

static CredoError_t se_spiflash_update_fwinfo_checksum(FWInfo_t* fwinfo) {
    uint32_t* p = (uint32_t*)fwinfo;
    uint32_t sum = 0;
    for (int i = 0; i < sizeof(FWInfo_t) / 4 - 1; i++) {
        sum += *p++;
    }
    fwinfo->checksum = 0xFFFFFFFF - sum + 1;
    return CR_OK;
}

#define CRDO_MAGIC 0x4352444f /* CRDO */
static CredoError_t se_spiflash_build_fwinfo(FWInfo_t* fwinfo, uint32_t history, uint32_t active_slot) {
    fwinfo->tag = CRDO_MAGIC;
    fwinfo->history = (history == 0xFFFFFFFF) ? 1 : history;
    fwinfo->active_slot = active_slot;
    return CR_OK;
}

static CredoError_t se_spiflash_build_slotinfo(SlotInfo_t* slotinfo, uint32_t sha[8], uint8_t revision[4],
                                               uint32_t img_src, uint32_t img_size) {
    if (sha) memcpy(slotinfo->checksum, sha, sizeof(slotinfo->checksum));
